MikroElektronika/SDK-Build-Tool/ARM/gcc_clang/def/nuvoton/M058SLAN/mcu.h
/*----------------------------- ADC Controller -------------------------------*/
/** @addtogroup ADC Analog to Digital Converter(ADC)
  Memory Mapped Structure for ADC Controller
  @{
 */

typedef struct
{


/**
 * @var ADC_T::ADDR
 * Offset: 0x00-0x1C  ADC Data Register 0~7
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |RSLT      |A/D Conversion Result(Read Only)
 * |        |          |This field contains conversion result of ADC.
 * |[16]    |OVERRUN   |Over Run Flag(Read Only)
 * |        |          |0 = Data in RSLT is not overwrote.
 * |        |          |1 = Data in RSLT is overwrote.
 * |        |          |If converted data in RSLT has not been read before new conversion result is
 * |        |          |loaded to this register, OVERRUN is set to 1. It will be cleared by hardware after
 * |        |          |ADDR register is read.
 * |[17]    |VALID     |Valid Flag(Read Only)
 * |        |          |0 = Data in RSLT bits is not valid.
 * |        |          |1 = Data in RSLT bits is valid.
 * |        |          |This bit will be set to 1 when the conversion of the corresponding channel is
 * |        |          |completed. This bit will be cleared to 0 by hardware after ADDR register is read.
 * |        |          |Note: When ADC is converting, if user wants to monitor the VALID flag of a specified channel,
 * |        |          |user should poll the VALID bit of ADSR register instead of polling this bit.
 * @var ADC_T::ADCR
 * Offset: 0x20  A/D Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |ADEN      |A/D Converter Enable
 * |        |          |0 = A/D converter Disabled.
 * |        |          |1 = A/D converter Enabled.
 * |        |          |Note: Before starting A/D conversion function, this bit should be set to 1. Clear it
 * |        |          |to 0 to disable A/D converter analog circuit to save power consumption.
 * |[1]     |ADIE      |A/D Interrupt Enable Control
 * |        |          |A/D conversion end interrupt request is generated if ADIE bit is set to 1.
 * |        |          |0 = A/D interrupt function Disabled.
 * |        |          |1 = A/D interrupt function Enabled.
 * |[3:2]   |ADMD      |A/D Converter Operation Mode Control
 * |        |          |00 = Single conversion.
 * |        |          |01 = Burst conversion.
 * |        |          |10 = Single-cycle scan.
 * |        |          |11 = Continuous scan.
 * |        |          |Note1: When changing the operation mode, software should clear ADST bit firstly.
 * |        |          |Note2: In Burst mode, the A/D result data always at Data Register 0.
 * |[5:4]   |TRGS      |Hardware Trigger Source
 * |        |          |00 = A/D conversion is started by external STADC pin.
 * |        |          |11 = A/D conversion is started by PWM trigger.
 * |        |          |Others = Reserved
 * |        |          |Note: Software should clear TRGEN bit and ADST bit to 0 before changing TRGS.
 * |[7:6]   |TRGCOND   |External Trigger Condition
 * |        |          |These two bits decide external pin STADC trigger event is level or edge. The signal
 * |        |          |must be kept at stable state at least 8 PCLKs for level trigger and at least
 * |        |          |4 PCLKs for edge trigger.
 * |        |          |00 = Low level.
 * |        |          |01 = High level.
 * |        |          |10 = Falling edge.
 * |        |          |11 = Rising edge.
 * |[8]     |TRGEN     |External Trigger Enable
 * |        |          |Enable or disable triggering of A/D conversion by external STADC pin.
 * |        |          |If external trigger is enabled, the ADST bit can be set to 1 by the selected hardware trigger source.
 * |        |          |0= External trigger Disabled.
 * |        |          |1= External trigger Enabled.
 * |[10]    |DIFFEN    |A/D Differential Input Mode Enable
 * |        |          |0 = Single-end analog input mode.
 * |        |          |1 = Differential analog input mode.
 * |        |          |Differential input voltage (Vdiff) = Vplus - Vminus,
 * |        |          |where Vplus is the analog input; Vminus is the inverted analog input.
 * |        |          |The Vplus of differential input paired channel 0 is from ADC0 pin; Vminus is from ADC1 pin.
 * |        |          |The Vplus of differential input paired channel 1 is from ADC2 pin; Vminus is from ADC3 pin.
 * |        |          |The Vplus of differential input paired channel 2 is from ADC4 pin; Vminus is from ADC5 pin.
 * |        |          |The Vplus of differential input paired channel 3 is from ADC6 pin; Vminus is from ADC7 pin.
 * |        |          |Note: In Differential Input mode, only the even number of the two corresponding
 * |        |          |channels needs to be enabled in ADCHER register. The conversion result
 * |        |          |will be placed to the corresponding data register of the enabled channel.
 * |[11]    |ADST      |A/D Conversion Start
 * |        |          |ADST bit can be set to 1 from two sources: software or external pin STADC.
 * |        |          |ADST will be cleared to 0 by hardware automatically at the ends of Single mode
 * |        |          |and Single-cycle Scan mode. In Continuous Scan mode and Burst mode, A/D
 * |        |          |conversion is continuously performed until software writes 0 to this bit or chip is reset.
 * |        |          |0 = Conversion stops and A/D converter enters idle state.
 * |        |          |1 = Conversion starts.
 * |[31]    |DMOF      |Differential Input Mode Output Format
 * |        |          |0 = A/D Conversion result will be filled in RSLT at ADDRx registers with unsigned format (straight binary format).
 * |        |          |1 = A/D Conversion result will be filled in RSLT at ADDRx registers with 2's complement format.
 * @var ADC_T::ADCHER
 * Offset: 0x24  A/D Channel Enable Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |CHEN      |Analog Input Channel Enable Control
 * |        |          |Set CHEN[7:0] to enable the corresponding analog input channel 7 ~ 0. If DIFFEN
 * |        |          |bit (ADCR[10]) is set to 1, only the even number channels need to be enabled.
 * |        |          |0 = ADC input channel Disabled.
 * |        |          |1 = ADC input channel Enabled.
 * |[9:8]   |PRESEL    |Analog Input Channel 7 Source Selection
 * |        |          |00 = External analog input.
 * |        |          |01 = Internal band-gap voltage.
 * |        |          |10 = Internal temperature sensor.
 * |        |          |11 = Reserved.
 * |        |          |Note: When the band-gap voltage is selected as the analog input source of ADC channel 7,
 * |        |          |ADC peripheral clock rate needs to be limited to lower than 300 kHz.
 * @var ADC_T::ADCMPR
 * Offset: 0x28,0x2C  A/D Compare Register 0 & 1
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |CMPEN     |Compare Enable Control
 * |        |          |Set this bit to 1 to enable compare CMPD[11:0] with specified channel conversion
 * |        |          |result when converted data is loaded into ADDR register.
 * |        |          |0 = Compare function Disabled.
 * |        |          |1 = Compare function Enabled.
 * |[1]     |CMPIE     |Compare Interrupt Enable Control
 * |        |          |If the compare function is enabled and the compare condition matches the settings
 * |        |          |of CMPCOND and CMPMATCNT, CMPFx bit will be asserted, in the meanwhile, If CMPIE is set to
 * |        |          |1, a compare interrupt request is generated.
 * |        |          |0 = Compare function interrupt Disabled.
 * |        |          |1 = Compare function interrupt Enabled.
 * |[2]     |CMPCOND   |Compare Condition
 * |        |          |0= Set the compare condition as that when a 12-bit A/D conversion result is less
 * |        |          |than the 12-bit CMPD (ADCMPRx[27:16]), the internal match counter will
 * |        |          |increase one.
 * |        |          |1= Set the compare condition as that when a 12-bit A/D conversion result is
 * |        |          |greater than or equal to the 12-bit CMPD (ADCMPRx[27:16]), the internal
 * |        |          |match counter will increase one.
 * |        |          |Note: When the internal counter reaches to (CMPMATCNT +1), the CMPFx bit will be set.
 * |[5:3]   |CMPCH     |Compare Channel Selection
 * |        |          |000 = Channel 0 conversion result is selected to be compared.
 * |        |          |001 = Channel 1 conversion result is selected to be compared.
 * |        |          |010 = Channel 2 conversion result is selected to be compared.
 * |        |          |011 = Channel 3 conversion result is selected to be compared.
 * |        |          |100 = Channel 4 conversion result is selected to be compared.
 * |        |          |101 = Channel 5 conversion result is selected to be compared.
 * |        |          |110 = Channel 6 conversion result is selected to be compared.
 * |        |          |111 = Channel 7 conversion result is selected to be compared.
 * |[11:8]  |CMPMATCNT |Compare Match Count
 * |        |          |When the specified A/D channel analog conversion result matches the compare
 * |        |          |condition defined by CMPCOND[2], the internal match counter will increase 1.
 * |        |          |When the internal counter reaches the value to (CMPMATCNT +1), the CMPFx bit
 * |        |          |will be set.
 * |[27:16] |CMPD      |Comparison Data
 * |        |          |The 12 bits data is used to compare with conversion result of specified channel.
 * |        |          |Note: CMPD should be filled in unsigned format (straight binary format).
 * @var ADC_T::ADSR
 * Offset: 0x30  ADC Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |ADF       |A/D Conversion End Flag
 * |        |          |A status flag that indicates the end of A/D conversion. Software can write 1 to clear this bit.
 * |        |          |ADF is set to 1 at these two conditions:
 * |        |          |1. When A/D conversion ends in single mode
 * |        |          |2. When A/D conversion ends on all specified channels in Single-cycle Scan mode and Continuous Scan mode.
 * |        |          |3. When more than 4 samples in FIFO in Burst mode.
 * |[1]     |CMPF0     |Compare Flag 0
 * |        |          |When the A/D conversion result of the selected channel meets setting condition
 * |        |          |in ADCMPR0 then this bit is set to 1. This bit is cleared by writing 1 to it.
 * |        |          |0 = Conversion result in ADDR does not meet ADCMPR0 setting.
 * |        |          |1 = Conversion result in ADDR meets ADCMPR0 setting.
 * |[2]     |CMPF1     |Compare Flag 1
 * |        |          |When the A/D conversion result of the selected channel meets setting condition
 * |        |          |in ADCMPR1 then this bit is set to 1; it is cleared by writing 1 to self.
 * |        |          |0 = Conversion result in ADDR does not meet ADCMPR1 setting.
 * |        |          |1 = Conversion result in ADDR meets ADCMPR1 setting.
 * |[3]     |BUSY      |BUSY/IDLE
 * |        |          |This bit is a mirror of ADST bit in ADCR register. It is read only.
 * |        |          |0 = A/D converter is in idle state.
 * |        |          |1 = A/D converter is busy at conversion.
 * |[6:4]   |CHANNEL   |Current Conversion Channel
 * |        |          |When BUSY=1, this filed reflects current conversion channel. When BUSY=0, it
 * |        |          |shows the number of the next converted channel.
 * |        |          |It is read only.
 * |[15:8]  |VALID     |Data Valid flag(Read Only)
 * |        |          |It is a mirror of VALID bit in ADDRx register.
 * |        |          |When ADC is in Burst mode and any conversion result is valid, all bits of
 * |        |          |VALID[7:0] will be set to 1.
 * |[23:16] |OVERRUN   |Overrun flag(Read Only)
 * |        |          |It is a mirror to OVERRUN bit in ADDRx register.
 * |        |          |When ADC is in Burst mode and the FIFO is overrun, all bits of OVERRUN[7:0] will be set to 1.
 * @var ADC_T::ADTDCR
 * Offset: 0x44  ADC Trigger Delay Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |PTDT      |PWM Trigger Delay Time
 * |        |          |Set this field will delay ADC start conversion time after PWM trigger.
 * |        |          |PWM trigger delay time is (4 * PTDT) * system clock
 */

    __I  uint32_t ADDR[8];       /* Offset: 0x00-0x1C  ADC Data Register 0~7                                         */
    __IO uint32_t ADCR;          /* Offset: 0x20  A/D Control Register                                               */
    __IO uint32_t ADCHER;        /* Offset: 0x24  A/D Channel Enable Register                                        */
    __IO uint32_t ADCMPR[2];     /* Offset: 0x28,0x2C  A/D Compare Register 0 & 1                                    */
    __IO uint32_t ADSR;          /* Offset: 0x30  ADC Status Register                                                */
    __I  uint32_t RESERVED0[4];
    __IO uint32_t ADTDCR;        /* Offset: 0x44  ADC Trigger Delay Control Register                                 */

} ADC_T;




/** @addtogroup ADC_CONST ADC Bit Field Definition
  Constant Definitions for ADC Controller
  @{
 */
/* ADDR Bit Field Definitions */
#define ADC_ADDR_VALID_Pos      17                                       /*!< ADC_T::ADDR: VALID Position */
#define ADC_ADDR_VALID_Msk      (1ul << ADC_ADDR_VALID_Pos)              /*!< ADC_T::ADDR: VALID Mask */

