MikroElektronika/SDK-Build-Tool/ARM/gcc_clang/def/nuvoton/M058SLAN/mcu.h
 * |[13]    |P1_ALT5   |P1.5 Alternate Function Selection
 * |        |          |The pin function of P1.5 is depend on P1_MFP[5] and P1_ALT[5].
 * |        |          |P1_ALT[5] P1_MFP[5] = P1.5 Function
 * |        |          |00 = P1.5
 * |        |          |01 = AIN5(ADC)
 * |        |          |10 = MOSI0(SPI0)
 * |        |          |11 = Reserved
 * |[14]    |P1_ALT6   |P1.6 Alternate Function Selection
 * |        |          |The pin function of P1.6 is depend on P1_MFP[6] and P1_ALT[6].
 * |        |          |P1_ALT[6] P1_MFP[6] = P1.6 Function
 * |        |          |00 = P1.6
 * |        |          |01 = AIN6(ADC)
 * |        |          |10 = MISO0(SPI0)
 * |        |          |11 = Reserved
 * |[15]    |P1_ALT7   |P1.7 Alternate Function Selection
 * |        |          |The pin function of P1.7 is depend on P1_MFP[7] and P1_ALT[7].
 * |        |          |P1_ALT[7] P1_MFP[7] = P1.7 Function
 * |        |          |00 = P1.7
 * |        |          |01 = AIN7(ADC)
 * |        |          |10 = SPICLK(SPI0)
 * |        |          |11 = Reserved
 * |[23:16] |P1_TYPEn  |P1[7:0] Input Schmitt Trigger function Enable
 * |        |          |0 = P1[7:0] I/O input Schmitt Trigger function Disabled.
 * |        |          |1 = P1[7:0] I/O input Schmitt Trigger function Enabled.
 * @var GCR_T::P2_MFP
 * Offset: 0x38  P2 Multiple Function and Input Type Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |P2_MFP    |P2 Multiple Function Selection
 * |        |          |The pin function of P2 is depending on P2_MFP and P2_ALT.
 * |        |          |Refer to P2_ALT descriptions in detail.
 * |[8]     |P2_ALT0   |P2.0 Alternate Function Selection
 * |        |          |The pin function of P2.0 is depend on P2_MFP[0] and P2_ALT[0].
 * |        |          |P2_ALT[0] P2_MFP[0] = P2.0 Function
 * |        |          |00 = P2.0
 * |        |          |01 = Reserved
 * |        |          |10 = PWM0(PWM channel 0)
 * |        |          |11 = Reserved
 * |[9]     |P2_ALT1   |P2.1 Alternate Function Selection
 * |        |          |The pin function of P2.1 is depend on P2_MFP[1] and P2_ALT[1].
 * |        |          |P2_ALT[1] P2_MFP[1] = P2.1 Function
 * |        |          |00 = P2.1
 * |        |          |01 = Reserved
 * |        |          |10 = PWM1(PWM channel 1)
 * |        |          |11 = Reserved
 * |[10]    |P2_ALT2   |P2.2 Alternate Function Selection
 * |        |          |The pin function of P2.2 is depend on P2_MFP[2] and P2_ALT[2].
 * |        |          |P2_ALT[2] P2_MFP[2] = P2.2 Function
 * |        |          |00 = P2.2
 * |        |          |01 = Reserved
 * |        |          |10 = PWM2(PWM channel 2)
 * |        |          |11 = Reserved
 * |[11]    |P2_ALT3   |P2.3 Alternate Function Selection
 * |        |          |The pin function of P2.3 is depend on P2_MFP[3] and P2_ALT[3].
 * |        |          |P2_ALT[3] P2_MFP[3] = P2.3 Function
 * |        |          |00 = P2.3
 * |        |          |01 = Reserved
 * |        |          |10 = PWM3(PWM channel 3)
 * |        |          |11 = Reserved
 * |[12]    |P2_ALT4   |P2.4 Alternate Function Selection
 * |        |          |The pin function of P2.4 is depend on P2_MFP[4] and P2_ALT[4].
 * |        |          |P2_ALT[4] P2_MFP[4] = P0.4 Function
 * |        |          |00 = P2.4
 * |        |          |01 = Reserved
 * |        |          |10 = Reserved
 * |        |          |11 = Reserved
 * |[13]    |P2_ALT5   |P2.5 Alternate Function Selection
 * |        |          |The pin function of P2.5 is depend on P2_MFP[5] and P2_ALT[5].
 * |        |          |P2_ALT[5] P2_MFP[5] = P2.5 Function
 * |        |          |00 = P2.5
 * |        |          |01 = Reserved
 * |        |          |10 = Reserved
 * |        |          |11 = Reserved
 * |[14]    |P2_ALT6   |P2.6 Alternate Function Selection
 * |        |          |The pin function of P2.6 is depend on P2_MFP[6] and P2_ALT[6].
 * |        |          |P2_ALT[6] P2_MFP[6] = P2.6 Function
 * |        |          |00 = P2.6
 * |        |          |01 = Reserved
 * |        |          |10 = Reserved
 * |        |          |11 = Reserved
 * |[15]    |P2_ALT7   |P2.7 Alternate Function Selection
 * |        |          |The pin function of P2.7 is depend on P2_MFP[7] and P2_ALT[7].
 * |        |          |P2_ALT[7] P2_MFP[7] = P2.7 Function
 * |        |          |00 = P2.7
 * |        |          |01 = Reserved
 * |        |          |10 = Reserved
 * |        |          |11 = Reserved
 * |[23:16] |P2_TYPEn  |P2[7:0] Input Schmitt Trigger function Enable
 * |        |          |0 = P2[7:0] I/O input Schmitt Trigger function Disable.
 * |        |          |1 = P2[7:0] I/O input Schmitt Trigger function Enable.
 * @var GCR_T::P3_MFP
 * Offset: 0x3C  P3 Multiple Function and Input Type Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |P3_MFP    |P3 Multiple Function Selection
 * |        |          |The pin function of P3 is depending on P3_MFP and P3_ALT.
 * |        |          |Refer to P3_ALT descriptions in detail.
 * |[8]     |P3_ALT0   |P3.0 Alternate Function Selection
 * |        |          |The pin function of P3.0 is depend on P3_MFP[0] and P3_ALT[0].
 * |        |          |P3_ALT[0] P3_MFP[0] = P3.0 Function
 * |        |          |00 = P3.0
 * |        |          |01 = RXD(UART0)
 * |        |          |10 = Reserved
 * |        |          |11 = Reserved
 * |[9]     |P3_ALT1   |P3.1 Alternate Function Selection
 * |        |          |The pin function of P3.1 is depend on P3_MFP[1] and P3_ALT[1].
 * |        |          |P3_ALT[1] P3_MFP[1] = P3.1 Function
 * |        |          |00 = P3.1
 * |        |          |01 = TXD(UART0)
 * |        |          |10 = Reserved
 * |        |          |11 = Reserved
 * |[10]    |P3_ALT2   |P3.2 Alternate Function Selection
 * |        |          |The pin function of P3.2 is depend on P3_MFP[2] and P3_ALT[2].
 * |        |          |P3_ALT[2] P3_MFP[2] = P3.2 Function
 * |        |          |00 = P3.2
 * |        |          |01 = nINT0
 * |        |          |10 = T0EX
 * |        |          |11 = Reserved
 * |[11]    |P3_ALT3   |P3.3 Alternate Function Selection
 * |        |          |The pin function of P3.3 is depend on P3_MFP[3] and P3_ALT[3].
 * |        |          |P3_ALT[3] P3_MFP[3] = P3.3 Function
 * |        |          |00 = P3.3
 * |        |          |01 = nINT1
 * |        |          |10 = Reserved
 * |        |          |11 = T1EX
 * |[12]    |P3_ALT4   |P3.4 Alternate Function Selection
 * |        |          |The pin function of P3.4 is depend on P3_MFP[4] and P3_ALT[4].
 * |        |          |P3_ALT[4] P3_MFP[4] = P3.4 Function
 * |        |          |00 = P3.4
 * |        |          |01 = T0(Timer0)
 * |        |          |10 = SDA0(I2C)
 * |        |          |11 = Reserved
 * |[13]    |P3_ALT5   |P3.5 Alternate Function Selection
 * |        |          |The pin function of P3.5 is depend on P3_MFP[5] and P3_ALT[5].
 * |        |          |P3_ALT[5] P3_MFP[5] = P3.5 Function
 * |        |          |00 = P3.5
 * |        |          |01 = T1(Timer1)
 * |        |          |10 = SCL0(I2C0)
 * |        |          |11 = CKO(Clock Driver Output)
 * |[14]    |P3_ALT6   |P3.6 Alternate Function Selection
 * |        |          |The pin function of P3.6 is depend on P3_MFP[6] and P3_ALT[6].
 * |        |          |P3_ALT[6] P3_MFP[6] = P3.6 Function
 * |        |          |00 = P3.6
 * |        |          |01 = Reserved
 * |        |          |10 = CKO(Clock Driver output)
 * |        |          |11 = Reserved
 * |[15]    |P3_ALT7   |P3.7 Alternate Function Selection
 * |        |          |The pin function of P3.7 is depend on P3_MFP[7] and P3_ALT[7].
 * |        |          |P3_ALT[7] P3_MFP[7] = P3.7 Function
 * |        |          |00 = P3.7
 * |        |          |01 = Reserved
 * |        |          |10 = Reserved
 * |        |          |11 = Reserved
 * |[23:16] |P3_TYPEn  |P3[7:0] Input Schmitt Trigger function Enable
 * |        |          |0 = P3[7:0] I/O input Schmitt Trigger function Disabled.
 * |        |          |1 = P3[7:0] I/O input Schmitt Trigger function Enabled.
 * @var GCR_T::P4_MFP
 * Offset: 0x40  P4 Multiple Function and Input Type Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |P4_MFP    |P4 Multiple Function Selection
 * |        |          |The pin function of P4 is depending on P4_MFP and P4_ALT.
 * |        |          |Refer to P4_ALT descriptions in detail.
 * |[8]     |P4_ALT0   |P4.0 Alternate Function Selection
 * |        |          |The pin function of P4.0 is depend on P4_MFP[0] and P4_ALT[0].
 * |        |          |P4_ALT[0] P4_MFP[0] = P4.0 Function
 * |        |          |00 = P4.0
 * |        |          |01 = PWM0(PWM channel 0)
 * |        |          |10 = T2EX
 * |        |          |11 = Reserved
 * |[9]     |P4_ALT1   |P4.1 Alternate Function Selection
 * |        |          |The pin function of P4.1 is depend on P4_MFP[1] and P4_ALT[1].
 * |        |          |P4_ALT[1] P4_MFP[1] = P4.1 Function
 * |        |          |00 = P4.1
 * |        |          |01 = PWM1(PWM channel 0)
 * |        |          |10 = T3EX
 * |        |          |11 = Reserved
 * |[10]    |P4_ALT2   |P4.2 Alternate Function Selection
 * |        |          |The pin function of P4.2 is depend on P4_MFP[2] and P4_ALT[2].
 * |        |          |P4_ALT[2] P4_MFP[2] = P4.2 Function
 * |        |          |00 = P4.2
 * |        |          |01 = PWM2(PWM channel 2)
 * |        |          |10 = Reserved
 * |        |          |11 = Reserved
 * |[11]    |P4_ALT3   |P4.3 Alternate Function Selection
 * |        |          |The pin function of P4.3 is depend on P4_MFP[3] and P4_ALT[3].
 * |        |          |P4_ALT[3] P4_MFP[3] = P4.3 Function
 * |        |          |00 = P4.3
 * |        |          |01 = PWM3(PWM channel 2)
 * |        |          |10 = Reserved
 * |        |          |11 = Reserved
 * |[12]    |P4_ALT4   |P4.4 Alternate Function Selection
 * |        |          |The pin function of P4.4 is depend on P4_MFP[4] and P4_ALT[4].
 * |        |          |P4_ALT[4] P4_MFP[4] = P4.4 Function
 * |        |          |00 = P4.4
 * |        |          |01 = Reserved
 * |        |          |10 = SCL1(I2C1)
 * |        |          |11 = Reserved
 * |[13]    |P4_ALT5   |P4.5 Alternate Function Selection
 * |        |          |The pin function of P4.5 is depend on P4_MFP[5] and P4_ALT[5].
 * |        |          |P4_ALT[5] P4_MFP[5] = P4.5 Function
 * |        |          |00 = P4.5
 * |        |          |01 = Reserved
 * |        |          |10 = SDA1(I2C1)
 * |        |          |11 = Reserved
 * |[14]    |P4_ALT6   |P4.6 Alternate Function Selection
 * |        |          |The pin function of P4.6 is depend on P4_MFP[6] and P4_ALT[6].
 * |        |          |P4_ALT[6] P4_MFP[6] = P4.6 Function
 * |        |          |00 = P4.6
 * |        |          |01 = ICE_CLK(ICE)
 * |        |          |10 = Reserved
 * |        |          |11 = Reserved
 * |[15]    |P4_ALT7   |P4.7 Alternate Function Selection
 * |        |          |The pin function of P4.7 is depend on P4_MFP[7] and P4_ALT[7].
 * |        |          |P4_ALT[7] P4_MFP[7] = P4.7 Function
 * |        |          |00 = P4.7
 * |        |          |01 = ICE_DAT(ICE)
 * |        |          |10 = Reserved
 * |        |          |11 = Reserved
 * |[23:16] |P4_TYPEn  |P4[7:0] Input Schmitt Trigger function Enable
 * |        |          |0 = P4[7:0] I/O input Schmitt Trigger function Disabled.
 * |        |          |1 = P4[7:0] I/O input Schmitt Trigger function Enabled.
 * @var GCR_T::P5_MFP
 * Offset: 0x44  P5 Multiple Function and Input Type Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |P5_MFP    |P5 Multiple Function Selection
 * |        |          |The pin function of P5 depends on P5_MFP and P5_ALT.
 * |        |          |Refer to P5_ALT for detailed description.
 * |[8]     |P5_ALT0   |P5.0 Alternate Function Selection
 * |        |          |The pin function of P5.0 depends on P5_MFP[0] and P5_ALT[0].
 * |        |          |P5_ALT[0] P5_MFP[0] = P5.0 function
 * |        |          |00 = P5.0
 * |        |          |01 = T0EX
 * |        |          |10 = Reserved
 * |        |          |11 = Reserved
 * |[9]     |P5_ALT1   |P5.1 Alternate Function Selection
 * |        |          |The pin function of P4.1 depends on P5_MFP[1] and P5_ALT[1].
 * |        |          |P5_ALT[1] P5_MFP[1] = P5.1 function
 * |        |          |00 = P5.1
 * |        |          |01 = T1EX
 * |        |          |10 = Reserved
 * |        |          |11 = Reserved
 * |[10]     |P5_ALT2  |P5.2 Alternate Function Selection
 * |        |          |The pin function of P5.2 depends on P5_MFP[2] and P5_ALT[2].
 * |        |          |P4_ALT[2] P4_MFP[2] = P4.2 function
 * |        |          |00 = P5.2
 * |        |          |01 = SDA0(I2C0)
 * |        |          |10 = Reserved
 * |        |          |11 = Reserved
 * |[11]     |P5_ALT3  |P5.3 Alternate Function Selection
 * |        |          |The pin function of P4.3 depends on P5_MFP[3] and P5_ALT[3].
 * |        |          |P5_ALT[3] P5_MFP[3] = P5.3 function
 * |        |          |00 = P5.3
 * |        |          |01 = SCL0(I2C0)
 * |        |          |10 = Reserved
 * |        |          |11 = Reserved
 * |[23:16] |P5_TYPEn  |P5[7:0] input Schmitt Trigger function Enable
 * |        |          |0 = P5[7:0] I/O input Schmitt Trigger function Disabled.
 * |        |          |1 = P5[7:0] I/O input Schmitt Trigger function Enabled.
 * @var GCR_T::P6_MFP
 * Offset: 0x48  P6 Multiple Function and Input Type Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[23:16] |P6_TYPEn  |P6[7:0] Input Schmitt Trigger Function Enable
 * |        |          |0 = P6[7:0] I/O input Schmitt Trigger function Disabled.
 * |        |          |1 = P6[7:0] I/O input Schmitt Trigger function Enabled.
 * @var GCR_T::P7_MFP
 * Offset: 0x4C  P7 Multiple Function and Input Type Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[1:0]   |P7_MFP[1:0]|P7 Multiple Function Selection
 * |        |          |The pin function of P7 depends on CONFIG0[27]
 * |        |          |0 = P7.0 and P7.1 pins are configured as GPIO pins.
 * |        |          |1 = P7.0 and P7.1 pins are configured as external 4~24MHz (high speed) crystal pins.
 * |[17:16] |P7_TYPEn  |P7[1:0] Input Schmitt Trigger function Enable Control
 * |        |          |0 = P7.0 and P7.1 input Schmitt Trigger function Disabled.
 * |        |          |1 = P7.0 and P7.1 input Schmitt Trigger function Enabled.
 * @var GCR_T::REGWRPROT
 * Offset: 0x100 Register Write-Protection Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |REGWRPROT |Register Write-Protected Code (Write Only)
 * |        |          |Some write-protected registers have to be disabled the protected function by writing the
 * |        |          |sequence value "59h", "16h", "88h" to this field. After this sequence is completed, the
 * |        |          |REGPROTDIS bit will be set to 1 and write-protected registers can be normal write.
 * |[0]     |REGPROTDIS|Register Write-Protected Disable index (Read only)
 * |        |          |0 = Protection is enabled for writing protected registers. Any write to the protected register is ignored.
 * |        |          |1 = Protection is disabled for writing protected registers.
 * |        |          |The Write-Protected registers list are below table:
 * |        |          |Registers Address Note
 * |        |          |IPRSTC1 0x5000_0008 None
 * |        |          |BODCR 0x5000_0018 None
 * |        |          |PORCR 0x5000_001C None
 * |        |          |PWRCON 0x5000_0200 bit[6] is not protected for power, wake-up interrupt clear
 * |        |          |APBCLK bit[0] 0x5000_0208 bit[0] is watch dog clock enable
 * |        |          |CLKSEL0 0x5000_0210 HCLK and CPU STCLK clock source select
 * |        |          |CLK_SEL1 bit[1:0] 0x5000_0214 Watch dog clock source select
 * |        |          |ISPCON 0x5000_C000 Flash ISP Control register
 * |        |          |ISPCON 0x5000_C010 ISP Trigger Control
 * |        |          |WTCR 0x4000_4000 None
 * |        |          |FATCON 0x5000_C018 None
 */

    __I  uint32_t PDID;          /* Offset: 0x00  Part Device Identification Number Register.                        */
    __IO uint32_t RSTSRC;        /* Offset: 0x04  System Reset Source Register                                       */
    __IO uint32_t IPRSTC1;       /* Offset: 0x08  Peripheral Reset Control Resister 1                                */
    __IO uint32_t IPRSTC2;       /* Offset: 0x0C  Peripheral Reset Control Resister 2                                */
    __I  uint32_t RESERVED0[2];
    __IO uint32_t BODCR;         /* Offset: 0x18  Brown-Out Detector Control Register                                */
    __IO uint32_t TEMPCR;        /* Offset: 0x1C  Temperature Sensor Control Register                                */
    __I  uint32_t RESERVED1;
    __IO uint32_t PORCR;         /* Offset: 0x24  Power-On-Reset Control Register                                    */
    __I  uint32_t RESERVED2[2];
    __IO uint32_t P0_MFP;        /* Offset: 0x30  P0 Multiple Function and Input Type Control Register               */
    __IO uint32_t P1_MFP;        /* Offset: 0x34  P1 Multiple Function and Input Type Control Register               */
    __IO uint32_t P2_MFP;        /* Offset: 0x38  P2 Multiple Function and Input Type Control Register               */
    __IO uint32_t P3_MFP;        /* Offset: 0x3C  P3 Multiple Function and Input Type Control Register               */
    __IO uint32_t P4_MFP;        /* Offset: 0x40  P4 Multiple Function and Input Type Control Register               */
    __IO uint32_t P5_MFP;        /* Offset: 0x44  P5 Multiple Function and Input Type Control Register               */
    __IO uint32_t P6_MFP;        /* Offset: 0x48  P6 Multiple Function and Input Type Control Register               */
    __IO uint32_t P7_MFP;        /* Offset: 0x4C  P7 Multiple Function and Input Type Control Register               */
    __I  uint32_t RESERVED3[44];
    __IO uint32_t REGWRPROT;     /* Offset: 0x100 Register Write-Protection Register                                 */

} GCR_T;




