MikroElektronika/SDK-Build-Tool/ARM/gcc_clang/def/nuvoton/M058SLAN/mcu.h
 * |        |          |1 = PWM channel 1 output to pin Enabled.
 * |        |          |Note: The corresponding GPIO pin also must be switched to PWM function.
 * |[2]     |PWM2      |PWM Channel 2 Output Enable Register
 * |        |          |0 = PWM channel 2 output to pin Disabled.
 * |        |          |1 = PWM channel 2 output to pin Enabled.
 * |        |          |Note: The corresponding GPIO pin also must be switched to PWM function.
 * |[3]     |PWM3      |PWM Channel 3 Output Enable Register
 * |        |          |0 = PWM channel 3 output to pin Disabled.
 * |        |          |1 = PWM channel 3 output to pin Enabled.
 * |        |          |Note: The corresponding GPIO pin also must be switched to PWM function.
 * @var PWM_T::TCON
 * Offset: 0x80  PWM Trigger Control Register for Channel 0~3
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |PWM0PTEN  |Channel 0 PWM Period Trigger ADC Enable Control
 * |        |          |0 = PWM channel 0 period trigger ADC function Disabled.
 * |        |          |1 = PWM channel 0 period trigger ADC function Enabled.
 * |        |          |As PWM operating at edge-aligned type, enable this bit can make PWM trigger ADC to start conversion when PWM channel 0 counter down count to underflow.
 * |        |          |As PWM operating at center-aligned type, enable this bit can make PWM trigger ADC to start conversion
 * |        |          |when PWM channel 0 counter up count to (CNR0 + 1) or down count to underflow based on INT01PTYPE setting.
 * |[1]     |PWM1PTEN  |Channel 1 PWM Period Trigger ADC Enable Control
 * |        |          |0 = PWM channel 1 period trigger ADC function Disabled.
 * |        |          |1 = PWM channel 1 period trigger ADC function Enabled.
 * |        |          |As PWM operating at edge-aligned type, enable this bit can make PWM trigger ADC to start conversion when PWM channel 1 counter down count to underflow.
 * |        |          |As PWM operating at center-aligned type, enable this bit can make PWM trigger ADC to start conversion
 * |        |          |when PWM channel 1 counter up count to (CNR1 + 1) or down count to underflow based on INT01PTYPE setting.
 * |[2]     |PWM2PTEN  |Channel 2 PWM Period Trigger ADC Enable Control
 * |        |          |0 = PWM channel 2 period trigger ADC function Disabled.
 * |        |          |1 = PWM channel 2 period trigger ADC function Enabled.
 * |        |          |As PWM operating at edge-aligned type, enable this bit can make PWM trigger ADC to start conversion when PWM channel 2 counter down count to underflow.
 * |        |          |As PWM operating at center-aligned type, enable this bit can make PWM trigger ADC to start conversion
 * |        |          |when PWM channel 2 counter up count to (CNR2 + 1) or down count to underflow based on INT23PTYPE setting.
 * |[3]     |PWM3PTEN  |Channel 3 PWM Period Trigger ADC Enable Control
 * |        |          |0 = PWM channel 3 period trigger ADC function Disabled.
 * |        |          |1 = PWM channel 3 period trigger ADC function Enabled.
 * |        |          |As PWM operating at edge-aligned type, enable this bit can make PWM trigger ADC to start conversion when PWM channel 3 counter down count to underflow.
 * |        |          |As PWM operating at center-aligned type, enable this bit can make PWM trigger ADC to start conversion
 * |        |          |when PWM channel 3 counter up count to (CNR3 + 1) or down count to underflow based on INT23PTYPE setting.
 * |[8]     |PWM0DTEN  |Channel 0 PWM Duty Trigger ADC Enable Control
 * |        |          |0 = PWM channel 0 duty trigger ADC function Disabled.
 * |        |          |1 = PWM channel 0 duty trigger ADC function Enabled.
 * |        |          |As PWM operating at edge-aligned type, enable this bit can make PWM trigger ADC to start conversion when PWM channel 0 counter down count to match CMR0.
 * |        |          |As PWM operating at center-aligned type, enable this bit can make PWM trigger ADC to start conversion
 * |        |          |when PWM channel 0 counter up count or down count to match CMR0 based on INT01DTYPE setting.
 * |[9]     |PWM1DTEN  |Channel 1 PWM Duty Trigger ADC Enable Control
 * |        |          |0 = PWM channel 1 duty trigger ADC function Disabled.
 * |        |          |1 = PWM channel 1 duty trigger ADC function Enabled.
 * |        |          |As PWM operating at edge-aligned type, enable this bit can make PWM trigger ADC to start conversion when PWM channel 1 counter down count to match CMR1.
 * |        |          |As PWM operating at center-aligned type, enable this bit can make PWM trigger ADC to start conversion
 * |        |          |when PWM channel 1 counter up count or down count to match CMR1 based on INT01DTYPE setting.
 * |[10]    |PWM2DTEN  |Channel 2 PWM Duty Trigger ADC Enable Control
 * |        |          |0 = PWM channel 2 duty trigger ADC function Disabled.
 * |        |          |1 = PWM channel 2 duty trigger ADC function Enabled.
 * |        |          |As PWM operating at edge-aligned type, enable this bit can make PWM trigger ADC to start conversion when PWM channel 2 counter down count to match CMR2.
 * |        |          |As PWM operating at center-aligned type, enable this bit can make PWM trigger ADC to start conversion
 * |        |          |when PWM channel 2 counter up count or down count to match CMR2 based on INT23DTYPE setting.
 * |[11]    |PWM3DTEN  |Channel 3 PWM Duty Trigger ADC Enable Control
 * |        |          |0 = PWM channel 3 duty trigger ADC function Disabled.
 * |        |          |1 = PWM channel 3 duty trigger ADC function Enabled.
 * |        |          |As PWM operating at edge-aligned type, enable this bit can make PWM trigger ADC to start conversion when PWM channel 3 counter down count to match CMR3.
 * |        |          |As PWM operating at center-aligned type, enable this bit can make PWM trigger ADC to start conversion
 * |        |          |when PWM channel 3 counter up count or down count to match CMR3 based on INT23DTYPE setting.
 * @var PWM_T::TSTATUS
 * Offset: 0x84  PWM Trigger Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |PWM0TF    |Channel 0 PWM Trigger ADC Flag
 * |        |          |This bit is set to 1 by hardware when PWM channel 0 trigger ADC condition
 * |        |          |matched. ADC will start conversion if ADC triggered source is selected by PWM
 * |        |          |while this bit is set to 1.
 * |[1]     |PWM1TF    |PWM Channel 1 Trigger ADC Flag
 * |        |          |This bit is set to 1 by hardware when PWM channel 1 trigger ADC condition
 * |        |          |matched. ADC will start conversion if ADC triggered source is selected by PWM
 * |        |          |while this bit is set to 1.
 * |[2]     |PWM2TF    |PWM Channel 2 Trigger ADC Flag
 * |        |          |This bit is set to 1 by hardware when PWM channel 2 trigger ADC condition
 * |        |          |matched. ADC will start conversion if ADC triggered source is selected by PWM
 * |        |          |while this bit is set to 1.
 * |[3]     |PWM3TF    |PWM Channel 3 Trigger ADC Flag
 * |        |          |This bit is set to 1 by hardware when PWM channel 3 trigger ADC condition
 * |        |          |matched. ADC will start conversion if ADC triggered source is selected by PWM
 * |        |          |while this bit is set to 1.
 * @var PWM_T::CAPIC
 * Offset: 0xA0  PWM Capture Interrupt Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |CIENS     |PWM Capture interrupt exception Number select
 * |        |          |This bit is to enable PWM0-3 capture interrupts have independent interrupt exception number.
 * |        |          |1 = Enable PWM0-3 independent capture interrupt exception number
 * |        |          |    PWM0-3 capture interrupt exception number is 36-39.
 * |        |          |0 = Disable PWM0-3 independent capture interrupt exception number
 * |        |          |    PWM0-3 capture interrupts are merged into interrupt exception number 22.
 */

    __IO uint32_t PPR;           /* Offset: 0x00  PWM Prescaler Register                                             */
    __IO uint32_t CSR;           /* Offset: 0x04  PWM Clock Source Divider Select Register                           */
    __IO uint32_t PCR;           /* Offset: 0x08  PWM Control Register                                               */
    __IO uint32_t CNR0;          /* Offset: 0x0C  PWM Counter Register 0                                             */
    __IO uint32_t CMR0;          /* Offset: 0x10  PWM Comparator Register 0                                          */
    __I  uint32_t PDR0;          /* Offset: 0x14  PWM Data Register 0                                                */
    __IO uint32_t CNR1;          /* Offset: 0x18  PWM Counter Register 1                                             */
    __IO uint32_t CMR1;          /* Offset: 0x1C  PWM Comparator Register 1                                          */
    __I  uint32_t PDR1;          /* Offset: 0x20  PWM Data Register 1                                                */
    __IO uint32_t CNR2;          /* Offset: 0x24  PWM Counter Register 2                                             */
    __IO uint32_t CMR2;          /* Offset: 0x28  PWM Comparator Register 2                                          */
    __I  uint32_t PDR2;          /* Offset: 0x2C  PWM Data Register 2                                                */
    __IO uint32_t CNR3;          /* Offset: 0x30  PWM Counter Register 3                                             */
    __IO uint32_t CMR3;          /* Offset: 0x34  PWM Comparator Register 3                                          */
    __I  uint32_t PDR3;          /* Offset: 0x38  PWM Data Register 3                                                */
    __I  uint32_t RESERVE0;
    __IO uint32_t PIER;          /* Offset: 0x40  PWM Interrupt Enable Register                                      */
    __IO uint32_t PIIR;          /* Offset: 0x44  PWM Interrupt Indication Register                                  */
    __I  uint32_t RESERVE1[2];
    __IO uint32_t CCR0;          /* Offset: 0x50  PWM Capture Control Register 0                                     */
    __IO uint32_t CCR2;          /* Offset: 0x54  PWM Capture Control Register 2                                     */
    __IO uint32_t CRLR0;         /* Offset: 0x58  PWM Capture Rising Latch Register (Channel 0)                      */
    __IO uint32_t CFLR0;         /* Offset: 0x5C  PWM Capture Falling Latch Register (Channel 0)                     */
    __IO uint32_t CRLR1;         /* Offset: 0x60  PWM Capture Rising Latch Register (Channel 1)                      */
    __IO uint32_t CFLR1;         /* Offset: 0x64  PWM Capture Falling Latch Register (Channel 1)                     */
    __IO uint32_t CRLR2;         /* Offset: 0x68  PWM Capture Rising Latch Register (Channel 2)                      */
    __IO uint32_t CFLR2;         /* Offset: 0x6C  PWM Capture Falling Latch Register (Channel 2)                     */
    __IO uint32_t CRLR3;         /* Offset: 0x70  PWM Capture Rising Latch Register (Channel 3)                      */
    __IO uint32_t CFLR3;         /* Offset: 0x74  PWM Capture Falling Latch Register (Channel 3)                     */
    __IO uint32_t CAPENR;        /* Offset: 0x78  PWM Capture Input 0~3 Enable Register                              */
    __IO uint32_t POE;           /* Offset: 0x7C  PWM Output Enable Register for Channel 0~3                         */
    __IO uint32_t TCON;          /* Offset: 0x80  PWM Trigger Control Register for Channel 0~3                       */
    __IO uint32_t TSTATUS;       /* Offset: 0x84  PWM Trigger Status Register                                        */
    __I  uint32_t RESERVED2[6];
    __IO uint32_t CAPIC;         /* Offset: 0xA0  PWM Capture Interrupt Control Register                             */

} PWM_T;



/** @addtogroup PWM_CONST PWM Bit Field Definition
  Constant Definitions for PWM Controller
  @{
 */

/* PWM PPR Bit Field Definitions */
#define PWM_PPR_DZI23_Pos                       24                                  /*!< PWM_T::PPR: DZI23 Position */
#define PWM_PPR_DZI23_Msk                       (0xFFul << PWM_PPR_DZI23_Pos)       /*!< PWM_T::PPR: DZI23 Mask */

#define PWM_PPR_DZI01_Pos                       16                                  /*!< PWM_T::PPR: DZI01 Position */
#define PWM_PPR_DZI01_Msk                       (0xFFul << PWM_PPR_DZI01_Pos)       /*!< PWM_T::PPR: DZI01 Mask */

